app/views/users/index.html.erb

                        <h4 class="media-heading"><%= conversation_interlocutor(conversation).username %></h4>
                        <p><%= conversation.messages.last.nil? ? "No messages" : truncate(conversation.messages.last.body, length: 45) %></p>
---
SELECT  "messages".* FROM "messages" WHERE "messages"."conversation_id" = ? ORDER BY "messages"."id" DESC LIMIT ?  [["conversation_id", 1], ["LIMIT", 1]]