app/controllers/commenters_controller.rb

  def index
    @commenters = Commenter.all
---
SELECT "commenters".* FROM "commenters"

  def create
    @commenter = Commenter.new(commenter_params)
@commenter.user = current_user

    respond_to do |format|
      if @commenter.save
---
INSERT INTO "commenters" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2017-12-14 10:42:28.203006"], ["updated_at", "2017-12-14 10:42:28.203006"], ["user_id", 1]]

    def set_commenter
      @commenter = Commenter.find(params[:id])
---
SELECT  "commenters".* FROM "commenters" WHERE "commenters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]