app/controllers/comments_controller.rb

INSERT INTO "commenters" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2017-12-15 18:18:11.878926"], ["updated_at", "2017-12-15 18:18:11.878926"], ["user_id", 1]]
INSERT INTO "comments" ("created_at", "updated_at", "commenter_id") VALUES (?, ?, ?)  [["created_at", "2017-12-14 16:55:33.612302"], ["updated_at", "2017-12-14 16:55:33.612302"], ["commenter_id", 1]]
---
  def create
@comment = Comment.new(comment_params)
@comment.commenter = current_commenter

    respond_to do |format|
      if @comment.save