app/controllers/conversations_controller.rb

SELECT  "conversations".* FROM "conversations" WHERE ((conversations.sender_id = '1' AND conversations.recipient_id ='2') OR (conversations.sender_id = '2' AND conversations.recipient_id ='1')) ORDER BY "conversations"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  1 AS one FROM "conversations" WHERE "conversations"."sender_id" = ? AND "conversations"."recipient_id" = ? LIMIT ?  [["sender_id", 1], ["recipient_id", 2], ["LIMIT", 1]]
INSERT INTO "conversations" ("sender_id", "recipient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["sender_id", 1], ["recipient_id", 2], ["created_at", "2017-12-16 16:55:44.146848"], ["updated_at", "2017-12-16 16:55:44.146848"]]
---
  def create
    if Conversation.between(params[:sender_id],params[:recipient_id]).present?
      @conversation = Conversation.between(params[:sender_id],params[:recipient_id]).first
    else
      @conversation = Conversation.create!(conversation_params)

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @conversation = Conversation.find(params[:id])