app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE (titre LiKE '%hello%')
---
  def index
    @courses = Course.all

INSERT INTO "authors" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2017-12-13 02:56:03.451061"], ["updated_at", "2017-12-13 02:56:03.451061"], ["user_id", 1]]
INSERT INTO "courses" ("titre", "matiere", "fac", "annee", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["titre", ""], ["matiere", ""], ["fac", ""], ["annee", ""], ["created_at", "2017-12-14 17:14:03.118421"], ["updated_at", "2017-12-14 17:14:03.118421"], ["author_id", 1]]
---
  def create
    current_author = Author.create(user: current_user)
    @course = author.courses.build(course_params)

    respond_to do |format|
      if @course.save

UPDATE "courses" SET "matiere" = ?, "fac" = ?, "annee" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["matiere", ""], ["fac", ""], ["annee", ""], ["updated_at", "2017-12-14 23:39:23.255886"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)