app/controllers/messages_controller.rb

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "messages" ("body", "conversation_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "pouet "], ["conversation_id", 1], ["user_id", 1], ["created_at", "2017-12-16 17:00:51.190107"], ["updated_at", "2017-12-16 17:00:51.190107"]]
---
  def create
    @conversation = Conversation.find(params[:conversation_id])
    @message = @conversation.messages.build(message_params)
    @message.user_id = current_user.id
    @message.save!